<?xml version="1.0" encoding="UTF-8"?><!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1">
    <dict>
        <key>PayloadUUID</key>
        <string>1DE2E5DB-3607-4247-B5B8-FB391073DCEC</string>
        <key>PayloadType</key>
        <string>Configuration</string>
        <key>PayloadOrganization</key>
        <string>Gemini</string>
        <key>PayloadIdentifier</key>
        <string>1DE2E5DB-3607-4247-B5B8-FB391073DCEC</string>
        <key>PayloadDisplayName</key>
        <string>DNShield App Config</string>
        <key>PayloadDescription</key>
        <string/>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>PayloadEnabled</key>
        <true/>
        <key>PayloadRemovalDisallowed</key>
        <true/>
        <key>PayloadScope</key>
        <string>System</string>
        <key>PayloadContent</key>
        <array>
            <dict>
                <key>PayloadUUID</key>
                <string>AE9919E2-8D61-459E-82E5-97E915DAE4E3</string>
                <key>PayloadType</key>
                <string>com.apple.TCC.configuration-profile-policy</string>
                <key>PayloadOrganization</key>
                <string>Gemini</string>
                <key>PayloadIdentifier</key>
                <string>AE9919E2-8D61-459E-82E5-97E915DAE4E3</string>
                <key>PayloadDisplayName</key>
                <string>PRIVACY_PREFERENCES_POLICY_CONTROL</string>
                <key>PayloadDescription</key>
                <string/>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>PayloadEnabled</key>
                <true/>
                <key>Services</key>
                <dict>
                    <key>SystemPolicyAllFiles</key>
                    <array>
                        <dict>
                            <key>Identifier</key>
                            <string>com.dnshield.app</string>
                            <key>CodeRequirement</key>
                            <string>identifier "com.dnshield.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = C6F9Y6M584</string>
                            <key>IdentifierType</key>
                            <string>bundleID</string>
                            <key>StaticCode</key>
                            <false/>
                            <key>Allowed</key>
                            <true/>
                        </dict>
                        <dict>
                            <key>Identifier</key>
                            <string>/usr/local/bin/dnshield-ctl</string>
                            <key>CodeRequirement</key>
                            <string>identifier "dnshield-ctl" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = C6F9Y6M584</string>
                            <key>IdentifierType</key>
                            <string>path</string>
                            <key>StaticCode</key>
                            <false/>
                            <key>Allowed</key>
                            <true/>
                        </dict>
                        <dict>
                            <key>Identifier</key>
                            <string>/usr/local/bin/dnshield-daemon</string>
                            <key>CodeRequirement</key>
                            <string>identifier "dnshield-daemon" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = C6F9Y6M584</string>
                            <key>IdentifierType</key>
                            <string>path</string>
                            <key>StaticCode</key>
                            <false/>
                            <key>Allowed</key>
                            <true/>
                        </dict>
                        <dict>
                            <key>Identifier</key>
                            <string>/usr/local/bin/dnshield-xpc</string>
                            <key>CodeRequirement</key>
                            <string>identifier "dnshield-xpc" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = C6F9Y6M584</string>
                            <key>IdentifierType</key>
                            <string>path</string>
                            <key>StaticCode</key>
                            <false/>
                            <key>Allowed</key>
                            <true/>
                        </dict>
                    </array>
                </dict>
            </dict>
            <dict>
                <key>PayloadUUID</key>
                <string>7DDC8D20-B6FD-4C22-BB1C-3D6F8E8B428F</string>
                <key>PayloadType</key>
                <string>com.apple.system-extension-policy</string>
                <key>PayloadOrganization</key>
                <string>Gemini</string>
                <key>PayloadIdentifier</key>
                <string>7DDC8D20-B6FD-4C22-BB1C-3D6F8E8B428F</string>
                <key>PayloadDisplayName</key>
                <string>SYSTEM_EXTENSIONS</string>
                <key>PayloadDescription</key>
                <string/>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>PayloadEnabled</key>
                <true/>
                <key>AllowUserOverrides</key>
                <true/>
                <key>AllowedTeamIdentifiers</key>
                <array>
                    <string>C6F9Y6M584</string>
                </array>
            </dict>
            <dict>
                <key>PayloadDisplayName</key>
                <string>Managed Login Items</string>
                <key>PayloadIdentifier</key>
                <string>9820B701-7C36-4CDA-9FC8-5559D22A3F14</string>
                <key>PayloadOrganization</key>
                <string>JAMF Software</string>
                <key>PayloadType</key>
                <string>com.apple.servicemanagement</string>
                <key>PayloadUUID</key>
                <string>9820B701-7C36-4CDA-9FC8-5559D22A3F14</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>Rules</key>
                <array>
                    <dict>
                        <key>Comment</key>
                        <string>DNShield</string>
                        <key>RuleType</key>
                        <string>TeamIdentifier</string>
                        <key>RuleValue</key>
                        <string>C6F9Y6M584</string>
                    </dict>
                </array>
            </dict>
            <dict>
                <key>PayloadDisplayName</key>
                <string>Custom Settings</string>
                <key>PayloadIdentifier</key>
                <string>740F200E-7D69-4109-971F-F4E0561D7557</string>
                <key>PayloadOrganization</key>
                <string>JAMF Software</string>
                <key>PayloadType</key>
                <string>com.apple.ManagedClient.preferences</string>
                <key>PayloadUUID</key>
                <string>740F200E-7D69-4109-971F-F4E0561D7557</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>PayloadContent</key>
                <dict>
                    <key>com.dnshield.app</key>
                    <dict>
                        <key>Forced</key>
                        <array>
                            <dict>
                                <key>mcx_preference_settings</key>
                                <dict>
                                    <key>EnableDNSChainPreservation</key>
                                    <true/>
                                    <key>EnableWebSocketServer</key>
                                    <true/>
                                    <key>ManagedMode</key>
                                    <true/>
                                    <key>ManifestURL</key>
                                    <string></string>
                                    <key>ManifestUpdateInterval</key>
                                    <integer>300</integer>
                                    <key>TelemetryEnabled</key>
                                    <true/>
                                    <key>TelemetryHECToken</key>
                                    <string></string>
                                    <key>TelemetryServerURL</key>
                                    <string></string>
                                    <key>UserCanAdjustCacheTTL</key>
                                    <true/>
                                    <key>WebSocketAuthToken</key>
                                    <string></string>
                                    <key>WebSocketPort</key>
                                    <integer></integer>
                                    <key>AdditionalHttpHeaders</key>
                                    <array>
                                        <string></string>
                                    </array>
                                    <key>VPNResolvers</key>
                                    <array>
                                        <string></string>
                                    </array>
                                </dict>
                            </dict>
                        </array>
                    </dict>
                </dict>
            </dict>
        </array>
    </dict>
</plist>